data/collected_data/watermelon/api/standarda2v2/j/load.txt
Running 30m test @ http://20.117.160.245:60
  2 threads and 1000 connections
  Thread calibration: mean lat.: 5285.313ms, rate sampling interval: 16580ms
  Thread calibration: mean lat.: 5529.409ms, rate sampling interval: 17317ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.09m     8.03m   27.84m    58.07%
    Req/Sec    64.05      4.36    72.00     75.71%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.08m 
 75.000%   21.04m 
 90.000%   25.17m 
 99.000%   27.84m 
 99.900%   28.47m 
 99.990%   28.89m 
 99.999%   29.38m 
100.000%   29.40m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6655.999     0.000000            1         1.00
  174718.975     0.100000        23126         1.11
  345767.935     0.200000        46239         1.25
  518258.687     0.300000        69330         1.43
  680525.823     0.400000        92518         1.67
  844627.967     0.500000       115552         2.00
  932184.063     0.550000       127124         2.22
 1017643.007     0.600000       138679         2.50
 1097859.071     0.650000       150253         2.86
 1179647.999     0.700000       161823         3.33
 1262485.503     0.750000       173336         4.00
 1302331.391     0.775000       179174         4.44
 1343225.855     0.800000       184927         5.00
 1383071.743     0.825000       190732         5.71
 1423966.207     0.850000       196435         6.67
 1468006.399     0.875000       202350         8.00
 1488977.919     0.887500       205182         8.89
 1509949.439     0.900000       208129        10.00
 1530920.959     0.912500       210908        11.43
 1553989.631     0.925000       213777        13.33
 1574961.151     0.937500       216667        16.00
 1586495.487     0.943750       218103        17.78
 1598029.823     0.950000       219675        20.00
 1607467.007     0.956250       221004        22.86
 1619001.343     0.962500       222508        26.67
 1629487.103     0.968750       224008        32.00
 1633681.407     0.971875       224647        35.56
 1638924.287     0.975000       225359        40.00
 1645215.743     0.978125       226125        45.71
 1650458.623     0.981250       226766        53.33
 1657798.655     0.984375       227484        64.00
 1660944.383     0.985938       227873        71.11
 1664090.111     0.987500       228228        80.00
 1668284.415     0.989062       228593        91.43
 1672478.719     0.990625       228934       106.67
 1677721.599     0.992188       229336       128.00
 1679818.751     0.992969       229493       142.22
 1681915.903     0.993750       229657       160.00
 1685061.631     0.994531       229849       182.86
 1688207.359     0.995313       230065       213.33
 1691353.087     0.996094       230249       256.00
 1692401.663     0.996484       230309       284.44
 1694498.815     0.996875       230428       320.00
 1695547.391     0.997266       230478       365.71
 1697644.543     0.997656       230563       426.67
 1699741.695     0.998047       230652       512.00
 1700790.271     0.998242       230693       568.89
 1701838.847     0.998437       230731       640.00
 1703935.999     0.998633       230779       731.43
 1706033.151     0.998828       230836       853.33
 1708130.303     0.999023       230873      1024.00
 1710227.455     0.999121       230906      1137.78
 1711276.031     0.999219       230920      1280.00
 1713373.183     0.999316       230937      1462.86
 1716518.911     0.999414       230956      1706.67
 1719664.639     0.999512       230979      2048.00
 1720713.215     0.999561       230991      2275.56
 1722810.367     0.999609       231007      2560.00
 1724907.519     0.999658       231016      2925.71
 1727004.671     0.999707       231027      3413.33
 1728053.247     0.999756       231038      4096.00
 1729101.823     0.999780       231049      4551.11
 1729101.823     0.999805       231049      5120.00
 1730150.399     0.999829       231055      5851.43
 1731198.975     0.999854       231063      6826.67
 1731198.975     0.999878       231063      8192.00
 1733296.127     0.999890       231075      9102.22
 1733296.127     0.999902       231075     10240.00
 1733296.127     0.999915       231075     11702.86
 1733296.127     0.999927       231075     13653.33
 1734344.703     0.999939       231077     16384.00
 1735393.279     0.999945       231079     18204.44
 1736441.855     0.999951       231081     20480.00
 1740636.159     0.999957       231082     23405.71
 1742733.311     0.999963       231083     27306.67
 1743781.887     0.999969       231084     32768.00
 1746927.615     0.999973       231085     36408.89
 1749024.767     0.999976       231086     40960.00
 1750073.343     0.999979       231087     46811.43
 1750073.343     0.999982       231087     54613.33
 1755316.223     0.999985       231088     65536.00
 1755316.223     0.999986       231088     72817.78
 1762656.255     0.999988       231090     81920.00
 1762656.255     0.999989       231090     93622.86
 1762656.255     0.999991       231090    109226.67
 1762656.255     0.999992       231090    131072.00
 1762656.255     0.999993       231090    145635.56
 1762656.255     0.999994       231090    163840.00
 1762656.255     0.999995       231090    187245.71
 1762656.255     0.999995       231090    218453.33
 1763704.831     0.999996       231091    262144.00
 1763704.831     1.000000       231091          inf
#[Mean    =   845554.482, StdDeviation   =   482012.126]
#[Max     =  1762656.256, Total count    =       231091]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  231950 requests in 30.00m, 107.93MB read
  Socket errors: connect 0, read 280213, write 543698, timeout 36027
  Non-2xx or 3xx responses: 1185
Requests/sec:    128.86
Transfer/sec:     61.40KB